mhightower83/Arduino/boards.txt
##############################################################
sonoff.name=ITEAD Sonoff
sonoff.menu.BoardModel.sonoffS20.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffS20.build.board=SONOFF_S20
sonoff.menu.BoardModel.sonoffBasicIR.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffBasicIR.build.variant=sonoff
sonoff.menu.BoardModel.sonoffSV.build.variant=sonoff
sonoff.menu.BoardModel.sonoffBasicIR=ITEAD Sonoff Basic - IRremote
sonoff.menu.BoardModel.sonoffBasic=ITEAD Sonoff Basic
sonoff.menu.BoardModel.sonoffS20=ITEAD Sonoff S20
sonoff.menu.BoardModel.sonoffBasic.build.board=SONOFF_BASIC
sonoff.menu.BoardModel.sonoffSV.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffSV=ITEAD Sonoff SV
sonoff.menu.BoardModel.sonoffBasic.build.variant=sonoff
sonoff.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffSV.build.board=SONOFF_SV
sonoff.menu.BoardModel.sonoffS20.build.variant=sonoff
sonoff.menu.BoardModel.sonoffBasicIR.build.board=SONOFF_BASIC
sonoff.menu.BoardModel.sonoffBasic.build.extra_flags=-DESP8266
sonoff.build.board=SONOFF_BASIC
sonoff.build.variant=sonoff
sonoff.upload.tool=esptool
sonoff.upload.maximum_data_size=81920
sonoff.upload.wait_for_upload_port=true
sonoff.upload.erase_cmd=version
sonoff.serial.disableDTR=true
sonoff.serial.disableRTS=true
sonoff.build.mcu=esp8266
sonoff.build.core=esp8266
sonoff.build.spiffs_pagesize=256
sonoff.build.debug_port=
sonoff.build.debug_level=
sonoff.menu.xtal.80=80 MHz
sonoff.menu.xtal.80.build.f_cpu=80000000L
sonoff.menu.xtal.160=160 MHz
sonoff.menu.xtal.160.build.f_cpu=160000000L
sonoff.menu.vt.flash=Flash
sonoff.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
sonoff.menu.vt.heap=Heap
sonoff.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
sonoff.menu.vt.iram=IRAM
sonoff.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
sonoff.menu.exception.disabled=Disabled
sonoff.menu.exception.disabled.build.exception_flags=-fno-exceptions
sonoff.menu.exception.disabled.build.stdcpp_lib=-lstdc++
sonoff.menu.exception.enabled=Enabled
sonoff.menu.exception.enabled.build.exception_flags=-fexceptions
sonoff.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
sonoff.menu.ssl.all=All SSL ciphers (most compatible)
sonoff.menu.ssl.all.build.sslflags=
sonoff.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
sonoff.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
sonoff.menu.my_project_flags.none=none
sonoff.menu.my_project_flags.nameresolv1=LLMNR Support
sonoff.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
sonoff.menu.my_project_flags.nameresolv2=NetBIOS Support
sonoff.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
sonoff.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
sonoff.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
sonoff.menu.ResetMethod.none=none
sonoff.menu.ResetMethod.none.upload.resetmethod=none
sonoff.menu.ResetMethod.dtrset=dtrset
sonoff.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
sonoff.menu.ResetMethod.ck=ck
sonoff.menu.ResetMethod.ck.upload.resetmethod=ck
sonoff.menu.ResetMethod.nodemcu=nodemcu
sonoff.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
sonoff.menu.FlashFreq.40=40MHz
sonoff.menu.FlashFreq.40.build.flash_freq=40
sonoff.menu.FlashFreq.80=80MHz
sonoff.menu.FlashFreq.80.build.flash_freq=80
sonoff.menu.FlashMode.dout=DOUT (compatible)
sonoff.menu.FlashMode.dout.build.flash_mode=dout
sonoff.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
sonoff.menu.FlashMode.dio=DIO
sonoff.menu.FlashMode.dio.build.flash_mode=dio
sonoff.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
sonoff.menu.FlashMode.qout=QOUT
sonoff.menu.FlashMode.qout.build.flash_mode=qout
sonoff.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
sonoff.menu.FlashMode.qio=QIO (fast)
sonoff.menu.FlashMode.qio.build.flash_mode=qio
sonoff.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
sonoff.menu.eesz.16M14M=16M (14M SPIFFS)
sonoff.menu.eesz.16M14M.build.flash_size=16M
sonoff.menu.eesz.16M14M.build.flash_size_bytes=0x1000000
sonoff.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
sonoff.menu.eesz.16M14M.build.spiffs_pagesize=256
sonoff.menu.eesz.16M14M.upload.maximum_size=1044464
sonoff.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
sonoff.menu.eesz.16M14M.build.spiffs_start=0x200000
sonoff.menu.eesz.16M14M.build.spiffs_end=0xFFB000
sonoff.menu.eesz.16M14M.build.spiffs_blocksize=8192
sonoff.menu.eesz.16M15M=16M (15M SPIFFS)
sonoff.menu.eesz.16M15M.build.flash_size=16M
sonoff.menu.eesz.16M15M.build.flash_size_bytes=0x1000000
sonoff.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
sonoff.menu.eesz.16M15M.build.spiffs_pagesize=256
sonoff.menu.eesz.16M15M.upload.maximum_size=1044464
sonoff.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
sonoff.menu.eesz.16M15M.build.spiffs_start=0x100000
sonoff.menu.eesz.16M15M.build.spiffs_end=0xFFB000
sonoff.menu.eesz.16M15M.build.spiffs_blocksize=8192
sonoff.menu.eesz.1M=1M (no SPIFFS)
sonoff.menu.eesz.1M.build.flash_size=1M
sonoff.menu.eesz.1M.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
sonoff.menu.eesz.1M.build.spiffs_pagesize=256
sonoff.menu.eesz.1M.upload.maximum_size=1023984
sonoff.menu.eesz.1M.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M64=1M (64K SPIFFS)
sonoff.menu.eesz.1M64.build.flash_size=1M
sonoff.menu.eesz.1M64.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
sonoff.menu.eesz.1M64.build.spiffs_pagesize=256
sonoff.menu.eesz.1M64.upload.maximum_size=958448
sonoff.menu.eesz.1M64.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M64.build.spiffs_start=0xEB000
sonoff.menu.eesz.1M64.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M64.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M128=1M (128K SPIFFS)
sonoff.menu.eesz.1M128.build.flash_size=1M
sonoff.menu.eesz.1M128.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
sonoff.menu.eesz.1M128.build.spiffs_pagesize=256
sonoff.menu.eesz.1M128.upload.maximum_size=892912
sonoff.menu.eesz.1M128.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M128.build.spiffs_start=0xDB000
sonoff.menu.eesz.1M128.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M128.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M144=1M (144K SPIFFS)
sonoff.menu.eesz.1M144.build.flash_size=1M
sonoff.menu.eesz.1M144.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
sonoff.menu.eesz.1M144.build.spiffs_pagesize=256
sonoff.menu.eesz.1M144.upload.maximum_size=876528
sonoff.menu.eesz.1M144.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M144.build.spiffs_start=0xD7000
sonoff.menu.eesz.1M144.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M144.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M160=1M (160K SPIFFS)
sonoff.menu.eesz.1M160.build.flash_size=1M
sonoff.menu.eesz.1M160.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
sonoff.menu.eesz.1M160.build.spiffs_pagesize=256
sonoff.menu.eesz.1M160.upload.maximum_size=860144
sonoff.menu.eesz.1M160.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M160.build.spiffs_start=0xD3000
sonoff.menu.eesz.1M160.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M160.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M192=1M (192K SPIFFS)
sonoff.menu.eesz.1M192.build.flash_size=1M
sonoff.menu.eesz.1M192.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
sonoff.menu.eesz.1M192.build.spiffs_pagesize=256
sonoff.menu.eesz.1M192.upload.maximum_size=827376
sonoff.menu.eesz.1M192.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M192.build.spiffs_start=0xCB000
sonoff.menu.eesz.1M192.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M192.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M256=1M (256K SPIFFS)
sonoff.menu.eesz.1M256.build.flash_size=1M
sonoff.menu.eesz.1M256.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
sonoff.menu.eesz.1M256.build.spiffs_pagesize=256
sonoff.menu.eesz.1M256.upload.maximum_size=761840
sonoff.menu.eesz.1M256.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M256.build.spiffs_start=0xBB000
sonoff.menu.eesz.1M256.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M256.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M512=1M (512K SPIFFS)
sonoff.menu.eesz.1M512.build.flash_size=1M
sonoff.menu.eesz.1M512.build.flash_size_bytes=0x100000
sonoff.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
sonoff.menu.eesz.1M512.build.spiffs_pagesize=256
sonoff.menu.eesz.1M512.upload.maximum_size=499696
sonoff.menu.eesz.1M512.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M512.build.spiffs_start=0x7B000
sonoff.menu.eesz.1M512.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M512.build.spiffs_blocksize=4096
sonoff.menu.eesz.2M=2M (no SPIFFS)
sonoff.menu.eesz.2M.build.flash_size=2M
sonoff.menu.eesz.2M.build.flash_size_bytes=0x200000
sonoff.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
sonoff.menu.eesz.2M.build.spiffs_pagesize=256
sonoff.menu.eesz.2M.upload.maximum_size=1044464
sonoff.menu.eesz.2M.build.rfcal_addr=0x1FC000
sonoff.menu.eesz.2M128=2M (128K SPIFFS)
sonoff.menu.eesz.2M128.build.flash_size=2M
sonoff.menu.eesz.2M128.build.flash_size_bytes=0x200000
sonoff.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
sonoff.menu.eesz.2M128.build.spiffs_pagesize=256
sonoff.menu.eesz.2M128.upload.maximum_size=1044464
sonoff.menu.eesz.2M128.build.rfcal_addr=0x1FC000
sonoff.menu.eesz.2M128.build.spiffs_start=0x1E0000
sonoff.menu.eesz.2M128.build.spiffs_end=0x1FB000
sonoff.menu.eesz.2M128.build.spiffs_blocksize=4096
sonoff.menu.eesz.2M256=2M (256K SPIFFS)
sonoff.menu.eesz.2M256.build.flash_size=2M
sonoff.menu.eesz.2M256.build.flash_size_bytes=0x200000
sonoff.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
sonoff.menu.eesz.2M256.build.spiffs_pagesize=256
sonoff.menu.eesz.2M256.upload.maximum_size=1044464
sonoff.menu.eesz.2M256.build.rfcal_addr=0x1FC000
sonoff.menu.eesz.2M256.build.spiffs_start=0x1C0000
sonoff.menu.eesz.2M256.build.spiffs_end=0x1FB000
sonoff.menu.eesz.2M256.build.spiffs_blocksize=4096
sonoff.menu.eesz.2M512=2M (512K SPIFFS)
sonoff.menu.eesz.2M512.build.flash_size=2M
sonoff.menu.eesz.2M512.build.flash_size_bytes=0x200000
sonoff.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
sonoff.menu.eesz.2M512.build.spiffs_pagesize=256
sonoff.menu.eesz.2M512.upload.maximum_size=1044464
sonoff.menu.eesz.2M512.build.rfcal_addr=0x1FC000
sonoff.menu.eesz.2M512.build.spiffs_start=0x180000
sonoff.menu.eesz.2M512.build.spiffs_end=0x1FB000
sonoff.menu.eesz.2M512.build.spiffs_blocksize=8192
sonoff.menu.eesz.2M1M=2M (1M SPIFFS)
sonoff.menu.eesz.2M1M.build.flash_size=2M
sonoff.menu.eesz.2M1M.build.flash_size_bytes=0x200000
sonoff.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
sonoff.menu.eesz.2M1M.build.spiffs_pagesize=256
sonoff.menu.eesz.2M1M.upload.maximum_size=1044464
sonoff.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
sonoff.menu.eesz.2M1M.build.spiffs_start=0x100000
sonoff.menu.eesz.2M1M.build.spiffs_end=0x1FB000
sonoff.menu.eesz.2M1M.build.spiffs_blocksize=8192
sonoff.menu.eesz.4M=4M (no SPIFFS)
sonoff.menu.eesz.4M.build.flash_size=4M
sonoff.menu.eesz.4M.build.flash_size_bytes=0x400000
sonoff.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
sonoff.menu.eesz.4M.build.spiffs_pagesize=256
sonoff.menu.eesz.4M.upload.maximum_size=1044464
sonoff.menu.eesz.4M.build.rfcal_addr=0x3FC000
sonoff.menu.eesz.4M1M=4M (1M SPIFFS)
sonoff.menu.eesz.4M1M.build.flash_size=4M
sonoff.menu.eesz.4M1M.build.flash_size_bytes=0x400000
sonoff.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
sonoff.menu.eesz.4M1M.build.spiffs_pagesize=256
sonoff.menu.eesz.4M1M.upload.maximum_size=1044464
sonoff.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
sonoff.menu.eesz.4M1M.build.spiffs_start=0x300000
sonoff.menu.eesz.4M1M.build.spiffs_end=0x3FB000
sonoff.menu.eesz.4M1M.build.spiffs_blocksize=8192
sonoff.menu.eesz.4M2M=4M (2M SPIFFS)
sonoff.menu.eesz.4M2M.build.flash_size=4M
sonoff.menu.eesz.4M2M.build.flash_size_bytes=0x400000
sonoff.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
sonoff.menu.eesz.4M2M.build.spiffs_pagesize=256
sonoff.menu.eesz.4M2M.upload.maximum_size=1044464
sonoff.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
sonoff.menu.eesz.4M2M.build.spiffs_start=0x200000
sonoff.menu.eesz.4M2M.build.spiffs_end=0x3FB000
sonoff.menu.eesz.4M2M.build.spiffs_blocksize=8192
sonoff.menu.eesz.4M3M=4M (3M SPIFFS)
sonoff.menu.eesz.4M3M.build.flash_size=4M
sonoff.menu.eesz.4M3M.build.flash_size_bytes=0x400000
sonoff.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
sonoff.menu.eesz.4M3M.build.spiffs_pagesize=256
sonoff.menu.eesz.4M3M.upload.maximum_size=1044464
sonoff.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
sonoff.menu.eesz.4M3M.build.spiffs_start=0x100000
sonoff.menu.eesz.4M3M.build.spiffs_end=0x3FB000
sonoff.menu.eesz.4M3M.build.spiffs_blocksize=8192
sonoff.menu.eesz.8M6M=8M (6M SPIFFS)
sonoff.menu.eesz.8M6M.build.flash_size=8M
sonoff.menu.eesz.8M6M.build.flash_size_bytes=0x800000
sonoff.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
sonoff.menu.eesz.8M6M.build.spiffs_pagesize=256
sonoff.menu.eesz.8M6M.upload.maximum_size=1044464
sonoff.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
sonoff.menu.eesz.8M6M.build.spiffs_start=0x200000
sonoff.menu.eesz.8M6M.build.spiffs_end=0x7FB000
sonoff.menu.eesz.8M6M.build.spiffs_blocksize=8192
sonoff.menu.eesz.8M7M=8M (7M SPIFFS)
sonoff.menu.eesz.8M7M.build.flash_size=8M
sonoff.menu.eesz.8M7M.build.flash_size_bytes=0x800000
sonoff.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
sonoff.menu.eesz.8M7M.build.spiffs_pagesize=256
sonoff.menu.eesz.8M7M.upload.maximum_size=1044464
sonoff.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
sonoff.menu.eesz.8M7M.build.spiffs_start=0x100000
sonoff.menu.eesz.8M7M.build.spiffs_end=0x7FB000
sonoff.menu.eesz.8M7M.build.spiffs_blocksize=8192
sonoff.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
sonoff.menu.sdk.nonosdk221.build.sdk=NONOSDK221
sonoff.menu.sdk.nonosdk222=nonos-sdk 2.2.2-190313 (testing)
sonoff.menu.sdk.nonosdk222.build.sdk=NONOSDK22x
sonoff.menu.sdk.nonosdk3v0=nonos-sdk pre-3 (known issues)
sonoff.menu.sdk.nonosdk3v0.build.sdk=NONOSDK3V0
sonoff.menu.ip.lm2f=v2 Lower Memory
sonoff.menu.ip.lm2f.build.lwip_include=lwip2/include
sonoff.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
sonoff.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff.menu.ip.hb2f=v2 Higher Bandwidth
sonoff.menu.ip.hb2f.build.lwip_include=lwip2/include
sonoff.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
sonoff.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff.menu.ip.lm2n=v2 Lower Memory (no features)
sonoff.menu.ip.lm2n.build.lwip_include=lwip2/include
sonoff.menu.ip.lm2n.build.lwip_lib=-llwip2-536
sonoff.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff.menu.ip.hb2n=v2 Higher Bandwidth (no features)
sonoff.menu.ip.hb2n.build.lwip_include=lwip2/include
sonoff.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
sonoff.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff.menu.ip.lm6f=v2 IPv6 Lower Memory
sonoff.menu.ip.lm6f.build.lwip_include=lwip2/include
sonoff.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
sonoff.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
sonoff.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
sonoff.menu.ip.hb6f.build.lwip_include=lwip2/include
sonoff.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
sonoff.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
sonoff.menu.ip.hb1=v1.4 Higher Bandwidth
sonoff.menu.ip.hb1.build.lwip_lib=-llwip_gcc
sonoff.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
sonoff.menu.ip.src=v1.4 Compile from source
sonoff.menu.ip.src.build.lwip_lib=-llwip_src
sonoff.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
sonoff.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
sonoff.menu.dbg.Disabled=Disabled
sonoff.menu.dbg.Disabled.build.debug_port=
sonoff.menu.dbg.Serial=Serial
sonoff.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
sonoff.menu.dbg.Serial1=Serial1
sonoff.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
sonoff.menu.lvl.None____=None
sonoff.menu.lvl.None____.build.debug_level=
sonoff.menu.lvl.SSL=SSL
sonoff.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
sonoff.menu.lvl.TLS_MEM=TLS_MEM
sonoff.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
sonoff.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
sonoff.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.HTTP_SERVER=HTTP_SERVER
sonoff.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
sonoff.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
sonoff.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
sonoff.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
sonoff.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
sonoff.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
