mhightower83/Arduino/boards.txt
sonoff.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.CORE=CORE
sonoff.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
sonoff.menu.lvl.WIFI=WIFI
sonoff.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
sonoff.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
sonoff.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
sonoff.menu.lvl.UPDATER=UPDATER
sonoff.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
sonoff.menu.lvl.OTA=OTA
sonoff.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
sonoff.menu.lvl.OOM=OOM
sonoff.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
sonoff.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
sonoff.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
sonoff.menu.wipe.none=Only Sketch
sonoff.menu.wipe.none.upload.erase_cmd=version
sonoff.menu.wipe.sdk=Sketch + WiFi Settings
sonoff.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
sonoff.menu.wipe.all=All Flash Contents
sonoff.menu.wipe.all.upload.erase_cmd=erase_flash
sonoff.menu.baud.115200=115200
sonoff.menu.baud.115200.upload.speed=115200
sonoff.menu.baud.9600=9600
sonoff.menu.baud.9600.upload.speed=9600
sonoff.menu.baud.57600=57600
sonoff.menu.baud.57600.upload.speed=57600
sonoff.menu.baud.230400.linux=230400
sonoff.menu.baud.230400.macosx=230400
sonoff.menu.baud.230400.upload.speed=230400
sonoff.menu.baud.256000.windows=256000
sonoff.menu.baud.256000.upload.speed=256000
sonoff.menu.baud.460800.linux=460800
sonoff.menu.baud.460800.macosx=460800
sonoff.menu.baud.460800.upload.speed=460800
sonoff.menu.baud.512000.windows=512000
sonoff.menu.baud.512000.upload.speed=512000
sonoff.menu.baud.921600=921600
sonoff.menu.baud.921600.upload.speed=921600

##############################################################
espurnakmc.name=ESPurna for KMC 70011
espurnakmc.build.board=ESP8266_GENERIC
espurnakmc.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DKMC_70011
espurnakmc.build.led=-DLED_BUILTIN=13
espurnakmc.upload.tool=esptool
espurnakmc.upload.maximum_data_size=81920
espurnakmc.upload.wait_for_upload_port=true
espurnakmc.upload.erase_cmd=version
espurnakmc.serial.disableDTR=true
espurnakmc.serial.disableRTS=true
espurnakmc.build.mcu=esp8266
espurnakmc.build.core=esp8266
espurnakmc.build.variant=generic
espurnakmc.build.spiffs_pagesize=256
espurnakmc.build.debug_port=
espurnakmc.build.debug_level=
espurnakmc.menu.xtal.80=80 MHz
espurnakmc.menu.xtal.80.build.f_cpu=80000000L
espurnakmc.menu.xtal.160=160 MHz
espurnakmc.menu.xtal.160.build.f_cpu=160000000L
espurnakmc.menu.vt.flash=Flash
espurnakmc.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espurnakmc.menu.vt.heap=Heap
espurnakmc.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espurnakmc.menu.vt.iram=IRAM
espurnakmc.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espurnakmc.menu.exception.disabled=Disabled
espurnakmc.menu.exception.disabled.build.exception_flags=-fno-exceptions
espurnakmc.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espurnakmc.menu.exception.enabled=Enabled
espurnakmc.menu.exception.enabled.build.exception_flags=-fexceptions
espurnakmc.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espurnakmc.menu.ssl.all=All SSL ciphers (most compatible)
espurnakmc.menu.ssl.all.build.sslflags=
espurnakmc.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espurnakmc.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espurnakmc.menu.espurna_ha.turnOnHaDomoticz=Domoticz
espurnakmc.menu.espurna_ha.turnOnHaDomoticz.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=1
espurnakmc.menu.espurna_ha.turnOnHaHomeAssistant=Home Assistant
espurnakmc.menu.espurna_ha.turnOnHaHomeAssistant.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=1 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=0
espurnakmc.menu.espurna_ha.turnOnHaThinkspeak=Thinkspeak
espurnakmc.menu.espurna_ha.turnOnHaThinkspeak.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=1 -DDOMOTICZ_SUPPORT=0
espurnakmc.menu.espurna_ha.none=none
espurnakmc.menu.espurna_flags.none=none
espurnakmc.menu.espurna_flags.i2cSupport=I2C Support
espurnakmc.menu.espurna_flags.i2cSupport.build.espurna_flags=-DI2C_SUPPORT=1
espurnakmc.menu.espurna_flags.dallasSupport=Dallas Support
espurnakmc.menu.espurna_flags.dallasSupport.build.espurna_flags=-DDALLAS_SUPPORT=1
espurnakmc.menu.espurna_flags.dhtSupport=DHT Support
espurnakmc.menu.espurna_flags.dhtSupport.build.espurna_flags=-DDHT_SUPPORT=1
espurnakmc.menu.espurna_flags.hlw9012Support=HLW9012 Support
espurnakmc.menu.espurna_flags.hlw9012Support.build.espurna_flags=-DHLW8012_SUPPORT=1
espurnakmc.menu.my_project_flags.none=none
espurnakmc.menu.my_project_flags.nameresolv1=LLMNR Support
espurnakmc.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
espurnakmc.menu.my_project_flags.nameresolv2=NetBIOS Support
espurnakmc.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
espurnakmc.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
espurnakmc.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
espurnakmc.menu.ResetMethod.none=none
espurnakmc.menu.ResetMethod.none.upload.resetmethod=none
espurnakmc.menu.ResetMethod.dtrset=dtrset
espurnakmc.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
espurnakmc.menu.ResetMethod.ck=ck
espurnakmc.menu.ResetMethod.ck.upload.resetmethod=ck
espurnakmc.menu.ResetMethod.nodemcu=nodemcu
espurnakmc.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espurnakmc.build.flash_freq=40
espurnakmc.build.flash_mode=qio
espurnakmc.build.flash_flags=-DFLASHMODE_QIO
espurnakmc.menu.eesz.1M=1M (no SPIFFS)
espurnakmc.menu.eesz.1M.build.flash_size=1M
espurnakmc.menu.eesz.1M.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
espurnakmc.menu.eesz.1M.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M.upload.maximum_size=1023984
espurnakmc.menu.eesz.1M.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M64=1M (64K SPIFFS)
espurnakmc.menu.eesz.1M64.build.flash_size=1M
espurnakmc.menu.eesz.1M64.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
espurnakmc.menu.eesz.1M64.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M64.upload.maximum_size=958448
espurnakmc.menu.eesz.1M64.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M64.build.spiffs_start=0xEB000
espurnakmc.menu.eesz.1M64.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M64.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M128=1M (128K SPIFFS)
espurnakmc.menu.eesz.1M128.build.flash_size=1M
espurnakmc.menu.eesz.1M128.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
espurnakmc.menu.eesz.1M128.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M128.upload.maximum_size=892912
espurnakmc.menu.eesz.1M128.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M128.build.spiffs_start=0xDB000
espurnakmc.menu.eesz.1M128.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M128.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M144=1M (144K SPIFFS)
espurnakmc.menu.eesz.1M144.build.flash_size=1M
espurnakmc.menu.eesz.1M144.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
espurnakmc.menu.eesz.1M144.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M144.upload.maximum_size=876528
espurnakmc.menu.eesz.1M144.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M144.build.spiffs_start=0xD7000
espurnakmc.menu.eesz.1M144.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M144.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M160=1M (160K SPIFFS)
espurnakmc.menu.eesz.1M160.build.flash_size=1M
espurnakmc.menu.eesz.1M160.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
espurnakmc.menu.eesz.1M160.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M160.upload.maximum_size=860144
espurnakmc.menu.eesz.1M160.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M160.build.spiffs_start=0xD3000
espurnakmc.menu.eesz.1M160.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M160.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M192=1M (192K SPIFFS)
espurnakmc.menu.eesz.1M192.build.flash_size=1M
espurnakmc.menu.eesz.1M192.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
espurnakmc.menu.eesz.1M192.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M192.upload.maximum_size=827376
espurnakmc.menu.eesz.1M192.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M192.build.spiffs_start=0xCB000
espurnakmc.menu.eesz.1M192.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M192.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M256=1M (256K SPIFFS)
espurnakmc.menu.eesz.1M256.build.flash_size=1M
espurnakmc.menu.eesz.1M256.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
espurnakmc.menu.eesz.1M256.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M256.upload.maximum_size=761840
espurnakmc.menu.eesz.1M256.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M256.build.spiffs_start=0xBB000
espurnakmc.menu.eesz.1M256.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M256.build.spiffs_blocksize=4096
espurnakmc.menu.eesz.1M512=1M (512K SPIFFS)
espurnakmc.menu.eesz.1M512.build.flash_size=1M
espurnakmc.menu.eesz.1M512.build.flash_size_bytes=0x100000
espurnakmc.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
espurnakmc.menu.eesz.1M512.build.spiffs_pagesize=256
espurnakmc.menu.eesz.1M512.upload.maximum_size=499696
espurnakmc.menu.eesz.1M512.build.rfcal_addr=0xFC000
espurnakmc.menu.eesz.1M512.build.spiffs_start=0x7B000
espurnakmc.menu.eesz.1M512.build.spiffs_end=0xFB000
espurnakmc.menu.eesz.1M512.build.spiffs_blocksize=4096
espurnakmc.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
espurnakmc.menu.sdk.nonosdk221.build.sdk=NONOSDK221
espurnakmc.menu.sdk.nonosdk222=nonos-sdk 2.2.2-190313 (testing)
espurnakmc.menu.sdk.nonosdk222.build.sdk=NONOSDK22x
espurnakmc.menu.sdk.nonosdk3v0=nonos-sdk pre-3 (known issues)
espurnakmc.menu.sdk.nonosdk3v0.build.sdk=NONOSDK3V0
espurnakmc.menu.ip.lm2f=v2 Lower Memory
espurnakmc.menu.ip.lm2f.build.lwip_include=lwip2/include
espurnakmc.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espurnakmc.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurnakmc.menu.ip.hb2f=v2 Higher Bandwidth
espurnakmc.menu.ip.hb2f.build.lwip_include=lwip2/include
espurnakmc.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espurnakmc.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurnakmc.menu.ip.lm2n=v2 Lower Memory (no features)
espurnakmc.menu.ip.lm2n.build.lwip_include=lwip2/include
espurnakmc.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espurnakmc.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurnakmc.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espurnakmc.menu.ip.hb2n.build.lwip_include=lwip2/include
espurnakmc.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espurnakmc.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurnakmc.menu.ip.lm6f=v2 IPv6 Lower Memory
espurnakmc.menu.ip.lm6f.build.lwip_include=lwip2/include
espurnakmc.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espurnakmc.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurnakmc.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espurnakmc.menu.ip.hb6f.build.lwip_include=lwip2/include
espurnakmc.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espurnakmc.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurnakmc.menu.ip.hb1=v1.4 Higher Bandwidth
espurnakmc.menu.ip.hb1.build.lwip_lib=-llwip_gcc
espurnakmc.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espurnakmc.menu.ip.src=v1.4 Compile from source
espurnakmc.menu.ip.src.build.lwip_lib=-llwip_src
espurnakmc.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
espurnakmc.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espurnakmc.menu.dbg.Disabled=Disabled
espurnakmc.menu.dbg.Disabled.build.debug_port=
espurnakmc.menu.dbg.Serial=Serial
espurnakmc.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espurnakmc.menu.dbg.Serial1=Serial1
espurnakmc.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espurnakmc.menu.lvl.None____=None
espurnakmc.menu.lvl.None____.build.debug_level=
espurnakmc.menu.lvl.SSL=SSL
espurnakmc.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espurnakmc.menu.lvl.TLS_MEM=TLS_MEM
espurnakmc.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espurnakmc.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espurnakmc.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espurnakmc.menu.lvl.HTTP_SERVER=HTTP_SERVER
espurnakmc.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espurnakmc.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espurnakmc.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espurnakmc.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espurnakmc.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espurnakmc.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espurnakmc.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurnakmc.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espurnakmc.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espurnakmc.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espurnakmc.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurnakmc.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurnakmc.menu.lvl.CORE=CORE
espurnakmc.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espurnakmc.menu.lvl.WIFI=WIFI
espurnakmc.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espurnakmc.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espurnakmc.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espurnakmc.menu.lvl.UPDATER=UPDATER
espurnakmc.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espurnakmc.menu.lvl.OTA=OTA
espurnakmc.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espurnakmc.menu.lvl.OOM=OOM
espurnakmc.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espurnakmc.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurnakmc.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurnakmc.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurnakmc.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espurnakmc.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espurnakmc.menu.wipe.none=Only Sketch
espurnakmc.menu.wipe.none.upload.erase_cmd=version
espurnakmc.menu.wipe.sdk=Sketch + WiFi Settings
espurnakmc.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espurnakmc.menu.wipe.all=All Flash Contents
espurnakmc.menu.wipe.all.upload.erase_cmd=erase_flash
espurnakmc.menu.baud.115200=115200
espurnakmc.menu.baud.115200.upload.speed=115200
espurnakmc.menu.baud.9600=9600
