mhightower83/Arduino/boards.txt
espurnakmc.menu.baud.9600.upload.speed=9600
espurnakmc.menu.baud.57600=57600
espurnakmc.menu.baud.57600.upload.speed=57600
espurnakmc.menu.baud.230400.linux=230400
espurnakmc.menu.baud.230400.macosx=230400
espurnakmc.menu.baud.230400.upload.speed=230400
espurnakmc.menu.baud.256000.windows=256000
espurnakmc.menu.baud.256000.upload.speed=256000
espurnakmc.menu.baud.460800.linux=460800
espurnakmc.menu.baud.460800.macosx=460800
espurnakmc.menu.baud.460800.upload.speed=460800
espurnakmc.menu.baud.512000.windows=512000
espurnakmc.menu.baud.512000.upload.speed=512000
espurnakmc.menu.baud.921600=921600
espurnakmc.menu.baud.921600.upload.speed=921600

##############################################################
espurna.name=ESPurna for ESP8266 based Modules
espurna.menu.BoardModel.sonoffS20.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_S20
espurna.menu.BoardModel.sonoffRF.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_RF
espurna.menu.BoardModel.sonoffBNSZ01.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_BNSZ01
espurna.menu.BoardModel.sonoffRFBridge=ITEAD Sonoff RF Bridge
espurna.menu.BoardModel.sonoffDualR2.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_DUAL_R2
espurna.menu.BoardModel.sonoffLED.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_LED
espurna.menu.BoardModel.sonoffRF=ITEAD Sonoff RF
espurna.menu.BoardModel.kmcSmartPlug.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DKMC_70011
espurna.menu.BoardModel.sonoffBNSZ01=ITEAD Sonoff BNSZ01
espurna.menu.BoardModel.sonoffPOW.build.led=-DLED_BUILTIN=15
espurna.menu.BoardModel.sonoffS20=ITEAD S20 Smart Socket
espurna.menu.BoardModel.sonoffDualR2.build.led=-DLED_BUILTIN=13
espurna.build.board=ESP8266_GENERIC
espurna.menu.BoardModel.sonoffRF.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffBNSZ01.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffSV.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_SV
espurna.menu.BoardModel.sonoffPOW=ITEAD Sonoff POW
espurna.menu.BoardModel.sonoffBasic=ITEAD Sonoff Basic
espurna.menu.BoardModel.sonoffDual.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffS20.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffPOW.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_POW
espurna.menu.BoardModel.sonoffTH=ITEAD Sonoff TH
espurna.menu.BoardModel.sonoff1CHInching.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_1CH_INCHING
espurna.menu.BoardModel.sonoffLED.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoff1CHInching.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffDual.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_DUAL
espurna.menu.BoardModel.iteadMotor=ITEAD Motor
espurna.menu.BoardModel.sonoffSlampher.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SLAMPHER
espurna.menu.BoardModel.iteadMotor.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffLED=ITEAD Sonoff LED
espurna.menu.BoardModel.kmcSmartPlug.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffTH.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffDualR2=ITEAD Sonoff Dual R2
espurna.menu.FlashMode.dout=DOUT
espurna.menu.BoardModel.sonoffSV.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffSlampher=ITEAD Slampher
espurna.menu.BoardModel.sonoffDual=ITEAD Sonoff Dual
espurna.menu.BoardModel.kmcSmartPlug=KMC WiFi Smart Plug (70011)
espurna.menu.BoardModel.sonoffTH.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_TH
espurna.menu.BoardModel.sonoffSV=ITEAD Sonoff SV
espurna.menu.BoardModel.sonoffRFBridge.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffSlampher.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoffBasic.build.led=-DLED_BUILTIN=13
espurna.menu.BoardModel.sonoff1CHInching=ITEAD 1CH Inching
espurna.menu.BoardModel.sonoffRFBridge.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_RFBRIDGE
espurna.menu.BoardModel.iteadMotor.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_MOTOR
espurna.menu.BoardModel.sonoffBasic.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_BASIC
espurna.upload.tool=esptool
espurna.upload.maximum_data_size=81920
espurna.upload.wait_for_upload_port=true
espurna.upload.erase_cmd=version
espurna.serial.disableDTR=true
espurna.serial.disableRTS=true
espurna.build.mcu=esp8266
espurna.build.core=esp8266
espurna.build.variant=generic
espurna.build.spiffs_pagesize=256
espurna.build.debug_port=
espurna.build.debug_level=
espurna.menu.xtal.80=80 MHz
espurna.menu.xtal.80.build.f_cpu=80000000L
espurna.menu.xtal.160=160 MHz
espurna.menu.xtal.160.build.f_cpu=160000000L
espurna.menu.vt.flash=Flash
espurna.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espurna.menu.vt.heap=Heap
espurna.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espurna.menu.vt.iram=IRAM
espurna.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espurna.menu.exception.disabled=Disabled
espurna.menu.exception.disabled.build.exception_flags=-fno-exceptions
espurna.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espurna.menu.exception.enabled=Enabled
espurna.menu.exception.enabled.build.exception_flags=-fexceptions
espurna.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espurna.menu.ssl.all=All SSL ciphers (most compatible)
espurna.menu.ssl.all.build.sslflags=
espurna.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espurna.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espurna.menu.espurna_ha.turnOnHaDomoticz=Domoticz
espurna.menu.espurna_ha.turnOnHaDomoticz.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=1
espurna.menu.espurna_ha.turnOnHaHomeAssistant=Home Assistant
espurna.menu.espurna_ha.turnOnHaHomeAssistant.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=1 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=0
espurna.menu.espurna_ha.turnOnHaThinkspeak=Thinkspeak
espurna.menu.espurna_ha.turnOnHaThinkspeak.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=1 -DDOMOTICZ_SUPPORT=0
espurna.menu.espurna_ha.none=none
espurna.menu.espurna_flags.none=none
espurna.menu.espurna_flags.i2cSupport=I2C Support
espurna.menu.espurna_flags.i2cSupport.build.espurna_flags=-DI2C_SUPPORT=1
espurna.menu.espurna_flags.dallasSupport=Dallas Support
espurna.menu.espurna_flags.dallasSupport.build.espurna_flags=-DDALLAS_SUPPORT=1
espurna.menu.espurna_flags.dhtSupport=DHT Support
espurna.menu.espurna_flags.dhtSupport.build.espurna_flags=-DDHT_SUPPORT=1
espurna.menu.espurna_flags.hlw9012Support=HLW9012 Support
espurna.menu.espurna_flags.hlw9012Support.build.espurna_flags=-DHLW8012_SUPPORT=1
espurna.menu.my_project_flags.none=none
espurna.menu.my_project_flags.nameresolv1=LLMNR Support
espurna.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
espurna.menu.my_project_flags.nameresolv2=NetBIOS Support
espurna.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
espurna.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
espurna.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
espurna.menu.ResetMethod.none=none
espurna.menu.ResetMethod.none.upload.resetmethod=none
espurna.menu.ResetMethod.dtrset=dtrset
espurna.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
espurna.menu.ResetMethod.ck=ck
espurna.menu.ResetMethod.ck.upload.resetmethod=ck
espurna.menu.ResetMethod.nodemcu=nodemcu
espurna.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espurna.menu.FlashFreq.40=40MHz
espurna.menu.FlashFreq.40.build.flash_freq=40
espurna.menu.FlashFreq.80=80MHz
espurna.menu.FlashFreq.80.build.flash_freq=80
espurna.menu.FlashMode.dout.build.flash_mode=dout
espurna.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
espurna.menu.FlashMode.dio=DIO
espurna.menu.FlashMode.dio.build.flash_mode=dio
espurna.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
espurna.menu.FlashMode.qout=QOUT
espurna.menu.FlashMode.qout.build.flash_mode=qout
espurna.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
espurna.menu.FlashMode.qio=QIO (fast)
espurna.menu.FlashMode.qio.build.flash_mode=qio
espurna.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
espurna.menu.eesz.1M=1M (no SPIFFS)
espurna.menu.eesz.1M.build.flash_size=1M
espurna.menu.eesz.1M.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
espurna.menu.eesz.1M.build.spiffs_pagesize=256
espurna.menu.eesz.1M.upload.maximum_size=1023984
espurna.menu.eesz.1M.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M64=1M (64K SPIFFS)
espurna.menu.eesz.1M64.build.flash_size=1M
espurna.menu.eesz.1M64.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
espurna.menu.eesz.1M64.build.spiffs_pagesize=256
espurna.menu.eesz.1M64.upload.maximum_size=958448
espurna.menu.eesz.1M64.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M64.build.spiffs_start=0xEB000
espurna.menu.eesz.1M64.build.spiffs_end=0xFB000
espurna.menu.eesz.1M64.build.spiffs_blocksize=4096
espurna.menu.eesz.1M128=1M (128K SPIFFS)
espurna.menu.eesz.1M128.build.flash_size=1M
espurna.menu.eesz.1M128.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
espurna.menu.eesz.1M128.build.spiffs_pagesize=256
espurna.menu.eesz.1M128.upload.maximum_size=892912
espurna.menu.eesz.1M128.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M128.build.spiffs_start=0xDB000
espurna.menu.eesz.1M128.build.spiffs_end=0xFB000
espurna.menu.eesz.1M128.build.spiffs_blocksize=4096
espurna.menu.eesz.1M144=1M (144K SPIFFS)
espurna.menu.eesz.1M144.build.flash_size=1M
espurna.menu.eesz.1M144.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
espurna.menu.eesz.1M144.build.spiffs_pagesize=256
espurna.menu.eesz.1M144.upload.maximum_size=876528
espurna.menu.eesz.1M144.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M144.build.spiffs_start=0xD7000
espurna.menu.eesz.1M144.build.spiffs_end=0xFB000
espurna.menu.eesz.1M144.build.spiffs_blocksize=4096
espurna.menu.eesz.1M160=1M (160K SPIFFS)
espurna.menu.eesz.1M160.build.flash_size=1M
espurna.menu.eesz.1M160.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
espurna.menu.eesz.1M160.build.spiffs_pagesize=256
espurna.menu.eesz.1M160.upload.maximum_size=860144
espurna.menu.eesz.1M160.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M160.build.spiffs_start=0xD3000
espurna.menu.eesz.1M160.build.spiffs_end=0xFB000
espurna.menu.eesz.1M160.build.spiffs_blocksize=4096
espurna.menu.eesz.1M192=1M (192K SPIFFS)
espurna.menu.eesz.1M192.build.flash_size=1M
espurna.menu.eesz.1M192.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
espurna.menu.eesz.1M192.build.spiffs_pagesize=256
espurna.menu.eesz.1M192.upload.maximum_size=827376
espurna.menu.eesz.1M192.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M192.build.spiffs_start=0xCB000
espurna.menu.eesz.1M192.build.spiffs_end=0xFB000
espurna.menu.eesz.1M192.build.spiffs_blocksize=4096
espurna.menu.eesz.1M256=1M (256K SPIFFS)
espurna.menu.eesz.1M256.build.flash_size=1M
espurna.menu.eesz.1M256.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
espurna.menu.eesz.1M256.build.spiffs_pagesize=256
espurna.menu.eesz.1M256.upload.maximum_size=761840
espurna.menu.eesz.1M256.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M256.build.spiffs_start=0xBB000
espurna.menu.eesz.1M256.build.spiffs_end=0xFB000
espurna.menu.eesz.1M256.build.spiffs_blocksize=4096
espurna.menu.eesz.1M512=1M (512K SPIFFS)
espurna.menu.eesz.1M512.build.flash_size=1M
espurna.menu.eesz.1M512.build.flash_size_bytes=0x100000
espurna.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
espurna.menu.eesz.1M512.build.spiffs_pagesize=256
espurna.menu.eesz.1M512.upload.maximum_size=499696
espurna.menu.eesz.1M512.build.rfcal_addr=0xFC000
espurna.menu.eesz.1M512.build.spiffs_start=0x7B000
espurna.menu.eesz.1M512.build.spiffs_end=0xFB000
espurna.menu.eesz.1M512.build.spiffs_blocksize=4096
espurna.menu.eesz.2M=2M (no SPIFFS)
espurna.menu.eesz.2M.build.flash_size=2M
espurna.menu.eesz.2M.build.flash_size_bytes=0x200000
espurna.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
espurna.menu.eesz.2M.build.spiffs_pagesize=256
espurna.menu.eesz.2M.upload.maximum_size=1044464
espurna.menu.eesz.2M.build.rfcal_addr=0x1FC000
espurna.menu.eesz.2M128=2M (128K SPIFFS)
espurna.menu.eesz.2M128.build.flash_size=2M
espurna.menu.eesz.2M128.build.flash_size_bytes=0x200000
espurna.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
espurna.menu.eesz.2M128.build.spiffs_pagesize=256
espurna.menu.eesz.2M128.upload.maximum_size=1044464
espurna.menu.eesz.2M128.build.rfcal_addr=0x1FC000
espurna.menu.eesz.2M128.build.spiffs_start=0x1E0000
espurna.menu.eesz.2M128.build.spiffs_end=0x1FB000
espurna.menu.eesz.2M128.build.spiffs_blocksize=4096
espurna.menu.eesz.2M256=2M (256K SPIFFS)
espurna.menu.eesz.2M256.build.flash_size=2M
espurna.menu.eesz.2M256.build.flash_size_bytes=0x200000
espurna.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
espurna.menu.eesz.2M256.build.spiffs_pagesize=256
espurna.menu.eesz.2M256.upload.maximum_size=1044464
espurna.menu.eesz.2M256.build.rfcal_addr=0x1FC000
espurna.menu.eesz.2M256.build.spiffs_start=0x1C0000
espurna.menu.eesz.2M256.build.spiffs_end=0x1FB000
espurna.menu.eesz.2M256.build.spiffs_blocksize=4096
espurna.menu.eesz.2M512=2M (512K SPIFFS)
espurna.menu.eesz.2M512.build.flash_size=2M
espurna.menu.eesz.2M512.build.flash_size_bytes=0x200000
espurna.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
espurna.menu.eesz.2M512.build.spiffs_pagesize=256
espurna.menu.eesz.2M512.upload.maximum_size=1044464
espurna.menu.eesz.2M512.build.rfcal_addr=0x1FC000
espurna.menu.eesz.2M512.build.spiffs_start=0x180000
espurna.menu.eesz.2M512.build.spiffs_end=0x1FB000
espurna.menu.eesz.2M512.build.spiffs_blocksize=8192
espurna.menu.eesz.2M1M=2M (1M SPIFFS)
espurna.menu.eesz.2M1M.build.flash_size=2M
espurna.menu.eesz.2M1M.build.flash_size_bytes=0x200000
espurna.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
espurna.menu.eesz.2M1M.build.spiffs_pagesize=256
espurna.menu.eesz.2M1M.upload.maximum_size=1044464
espurna.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
espurna.menu.eesz.2M1M.build.spiffs_start=0x100000
espurna.menu.eesz.2M1M.build.spiffs_end=0x1FB000
espurna.menu.eesz.2M1M.build.spiffs_blocksize=8192
espurna.menu.eesz.4M=4M (no SPIFFS)
espurna.menu.eesz.4M.build.flash_size=4M
espurna.menu.eesz.4M.build.flash_size_bytes=0x400000
espurna.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espurna.menu.eesz.4M.build.spiffs_pagesize=256
espurna.menu.eesz.4M.upload.maximum_size=1044464
espurna.menu.eesz.4M.build.rfcal_addr=0x3FC000
espurna.menu.eesz.4M1M=4M (1M SPIFFS)
espurna.menu.eesz.4M1M.build.flash_size=4M
espurna.menu.eesz.4M1M.build.flash_size_bytes=0x400000
espurna.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espurna.menu.eesz.4M1M.build.spiffs_pagesize=256
espurna.menu.eesz.4M1M.upload.maximum_size=1044464
espurna.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espurna.menu.eesz.4M1M.build.spiffs_start=0x300000
espurna.menu.eesz.4M1M.build.spiffs_end=0x3FB000
espurna.menu.eesz.4M1M.build.spiffs_blocksize=8192
espurna.menu.eesz.4M2M=4M (2M SPIFFS)
espurna.menu.eesz.4M2M.build.flash_size=4M
espurna.menu.eesz.4M2M.build.flash_size_bytes=0x400000
espurna.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espurna.menu.eesz.4M2M.build.spiffs_pagesize=256
espurna.menu.eesz.4M2M.upload.maximum_size=1044464
espurna.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espurna.menu.eesz.4M2M.build.spiffs_start=0x200000
espurna.menu.eesz.4M2M.build.spiffs_end=0x3FB000
espurna.menu.eesz.4M2M.build.spiffs_blocksize=8192
espurna.menu.eesz.4M3M=4M (3M SPIFFS)
espurna.menu.eesz.4M3M.build.flash_size=4M
espurna.menu.eesz.4M3M.build.flash_size_bytes=0x400000
espurna.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espurna.menu.eesz.4M3M.build.spiffs_pagesize=256
espurna.menu.eesz.4M3M.upload.maximum_size=1044464
espurna.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espurna.menu.eesz.4M3M.build.spiffs_start=0x100000
espurna.menu.eesz.4M3M.build.spiffs_end=0x3FB000
espurna.menu.eesz.4M3M.build.spiffs_blocksize=8192
espurna.menu.eesz.8M6M=8M (6M SPIFFS)
espurna.menu.eesz.8M6M.build.flash_size=8M
espurna.menu.eesz.8M6M.build.flash_size_bytes=0x800000
espurna.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
espurna.menu.eesz.8M6M.build.spiffs_pagesize=256
espurna.menu.eesz.8M6M.upload.maximum_size=1044464
espurna.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
espurna.menu.eesz.8M6M.build.spiffs_start=0x200000
espurna.menu.eesz.8M6M.build.spiffs_end=0x7FB000
espurna.menu.eesz.8M6M.build.spiffs_blocksize=8192
espurna.menu.eesz.8M7M=8M (7M SPIFFS)
espurna.menu.eesz.8M7M.build.flash_size=8M
espurna.menu.eesz.8M7M.build.flash_size_bytes=0x800000
espurna.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
espurna.menu.eesz.8M7M.build.spiffs_pagesize=256
espurna.menu.eesz.8M7M.upload.maximum_size=1044464
espurna.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
espurna.menu.eesz.8M7M.build.spiffs_start=0x100000
espurna.menu.eesz.8M7M.build.spiffs_end=0x7FB000
espurna.menu.eesz.8M7M.build.spiffs_blocksize=8192
espurna.menu.eesz.16M14M=16M (14M SPIFFS)
espurna.menu.eesz.16M14M.build.flash_size=16M
espurna.menu.eesz.16M14M.build.flash_size_bytes=0x1000000
espurna.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
espurna.menu.eesz.16M14M.build.spiffs_pagesize=256
espurna.menu.eesz.16M14M.upload.maximum_size=1044464
espurna.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
espurna.menu.eesz.16M14M.build.spiffs_start=0x200000
espurna.menu.eesz.16M14M.build.spiffs_end=0xFFB000
espurna.menu.eesz.16M14M.build.spiffs_blocksize=8192
espurna.menu.eesz.16M15M=16M (15M SPIFFS)
espurna.menu.eesz.16M15M.build.flash_size=16M
