mhightower83/Arduino/boards.txt
espurna.menu.eesz.16M15M.build.flash_size_bytes=0x1000000
espurna.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
espurna.menu.eesz.16M15M.build.spiffs_pagesize=256
espurna.menu.eesz.16M15M.upload.maximum_size=1044464
espurna.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
espurna.menu.eesz.16M15M.build.spiffs_start=0x100000
espurna.menu.eesz.16M15M.build.spiffs_end=0xFFB000
espurna.menu.eesz.16M15M.build.spiffs_blocksize=8192
espurna.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
espurna.menu.sdk.nonosdk221.build.sdk=NONOSDK221
espurna.menu.sdk.nonosdk222=nonos-sdk 2.2.2-190313 (testing)
espurna.menu.sdk.nonosdk222.build.sdk=NONOSDK22x
espurna.menu.sdk.nonosdk3v0=nonos-sdk pre-3 (known issues)
espurna.menu.sdk.nonosdk3v0.build.sdk=NONOSDK3V0
espurna.menu.ip.lm2f=v2 Lower Memory
espurna.menu.ip.lm2f.build.lwip_include=lwip2/include
espurna.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espurna.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurna.menu.ip.hb2f=v2 Higher Bandwidth
espurna.menu.ip.hb2f.build.lwip_include=lwip2/include
espurna.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espurna.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurna.menu.ip.lm2n=v2 Lower Memory (no features)
espurna.menu.ip.lm2n.build.lwip_include=lwip2/include
espurna.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espurna.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurna.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espurna.menu.ip.hb2n.build.lwip_include=lwip2/include
espurna.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espurna.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurna.menu.ip.lm6f=v2 IPv6 Lower Memory
espurna.menu.ip.lm6f.build.lwip_include=lwip2/include
espurna.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espurna.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurna.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espurna.menu.ip.hb6f.build.lwip_include=lwip2/include
espurna.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espurna.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurna.menu.ip.hb1=v1.4 Higher Bandwidth
espurna.menu.ip.hb1.build.lwip_lib=-llwip_gcc
espurna.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espurna.menu.ip.src=v1.4 Compile from source
espurna.menu.ip.src.build.lwip_lib=-llwip_src
espurna.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
espurna.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espurna.menu.dbg.Disabled=Disabled
espurna.menu.dbg.Disabled.build.debug_port=
espurna.menu.dbg.Serial=Serial
espurna.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espurna.menu.dbg.Serial1=Serial1
espurna.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espurna.menu.lvl.None____=None
espurna.menu.lvl.None____.build.debug_level=
espurna.menu.lvl.SSL=SSL
espurna.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espurna.menu.lvl.TLS_MEM=TLS_MEM
espurna.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espurna.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espurna.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espurna.menu.lvl.HTTP_SERVER=HTTP_SERVER
espurna.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espurna.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espurna.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espurna.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espurna.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espurna.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espurna.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurna.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espurna.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espurna.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurna.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espurna.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espurna.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurna.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna.menu.lvl.CORE=CORE
espurna.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espurna.menu.lvl.WIFI=WIFI
espurna.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espurna.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espurna.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espurna.menu.lvl.UPDATER=UPDATER
espurna.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espurna.menu.lvl.OTA=OTA
espurna.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espurna.menu.lvl.OOM=OOM
espurna.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espurna.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espurna.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espurna.menu.wipe.none=Only Sketch
espurna.menu.wipe.none.upload.erase_cmd=version
espurna.menu.wipe.sdk=Sketch + WiFi Settings
espurna.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espurna.menu.wipe.all=All Flash Contents
espurna.menu.wipe.all.upload.erase_cmd=erase_flash
espurna.menu.baud.115200=115200
espurna.menu.baud.115200.upload.speed=115200
espurna.menu.baud.9600=9600
espurna.menu.baud.9600.upload.speed=9600
espurna.menu.baud.57600=57600
espurna.menu.baud.57600.upload.speed=57600
espurna.menu.baud.230400.linux=230400
espurna.menu.baud.230400.macosx=230400
espurna.menu.baud.230400.upload.speed=230400
espurna.menu.baud.256000.windows=256000
espurna.menu.baud.256000.upload.speed=256000
espurna.menu.baud.460800.linux=460800
espurna.menu.baud.460800.macosx=460800
espurna.menu.baud.460800.upload.speed=460800
espurna.menu.baud.512000.windows=512000
espurna.menu.baud.512000.upload.speed=512000
espurna.menu.baud.921600=921600
espurna.menu.baud.921600.upload.speed=921600

