mhightower83/Arduino/boards.txt
##############################################################
espurna85.name=ESPurna for ESP8285 based Modules
espurna85.menu.BoardModel.sonoffT12CH=ITEAD Sonoff T1 2CH
espurna85.menu.BoardModel.sonoff4CHPro.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_4CH_PRO
espurna85.menu.BoardModel.sonoffB1.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_B1
espurna85.menu.BoardModel.sonoff4CHPro=ITEAD Sonoff 4CH Pro
espurna85.menu.BoardModel.sonoffT12CH.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_T1_2CH
espurna85.menu.BoardModel.sonoff4CH.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_4CH
espurna85.menu.BoardModel.sonoffT13CH=ITEAD Sonoff T1 3CH
espurna85.menu.led.13=13
espurna85.menu.BoardModel.sonoffTouch.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_TOUCH
espurna85.menu.BoardModel.sonoffTouch=ITEAD Sonoff Touch
espurna85.menu.BoardModel.sonoffT11CH.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_T1_1CH
espurna85.menu.FlashMode.dout=DOUT
espurna85.menu.BoardModel.sonoff4CH=ITEAD Sonoff 4CH
espurna85.menu.BoardModel.AIThinkerWifiLight=AI-Thinker Wifi Light
espurna85.menu.BoardModel.sonoffT13CH.build.extra_flags=-DESP8266 -DMQTT_MAX_PACKET_SIZE=400 -DESPURNA -DITEAD_SONOFF_T1_3CH
espurna85.build.board=ESP8266_ESP01
espurna85.build.variant=esp8285
espurna85.menu.BoardModel.sonoffT11CH=ITEAD Sonoff T1 1CH
espurna85.menu.BoardModel.AIThinkerWifiLight.build.extra_flags=-DESP8266 -DAITHINKER_AI_LIGHT
espurna85.menu.BoardModel.sonoffB1=ITEAD Sonoff B1
espurna85.upload.tool=esptool
espurna85.upload.maximum_data_size=81920
espurna85.upload.wait_for_upload_port=true
espurna85.upload.erase_cmd=version
espurna85.serial.disableDTR=true
espurna85.serial.disableRTS=true
espurna85.build.mcu=esp8266
espurna85.build.core=esp8266
espurna85.build.spiffs_pagesize=256
espurna85.build.debug_port=
espurna85.build.debug_level=
espurna85.menu.xtal.80=80 MHz
espurna85.menu.xtal.80.build.f_cpu=80000000L
espurna85.menu.xtal.160=160 MHz
espurna85.menu.xtal.160.build.f_cpu=160000000L
espurna85.menu.vt.flash=Flash
espurna85.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espurna85.menu.vt.heap=Heap
espurna85.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espurna85.menu.vt.iram=IRAM
espurna85.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espurna85.menu.exception.disabled=Disabled
espurna85.menu.exception.disabled.build.exception_flags=-fno-exceptions
espurna85.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espurna85.menu.exception.enabled=Enabled
espurna85.menu.exception.enabled.build.exception_flags=-fexceptions
espurna85.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espurna85.menu.ssl.all=All SSL ciphers (most compatible)
espurna85.menu.ssl.all.build.sslflags=
espurna85.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espurna85.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espurna85.menu.espurna_ha.turnOnHaDomoticz=Domoticz
espurna85.menu.espurna_ha.turnOnHaDomoticz.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=1
espurna85.menu.espurna_ha.turnOnHaHomeAssistant=Home Assistant
espurna85.menu.espurna_ha.turnOnHaHomeAssistant.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=1 -DTHINGSPEAK_SUPPORT=0 -DDOMOTICZ_SUPPORT=0
espurna85.menu.espurna_ha.turnOnHaThinkspeak=Thinkspeak
espurna85.menu.espurna_ha.turnOnHaThinkspeak.build.espurna_ha_flags=-DHOMEASSISTANT_SUPPORT=0 -DTHINGSPEAK_SUPPORT=1 -DDOMOTICZ_SUPPORT=0
espurna85.menu.espurna_ha.none=none
espurna85.menu.espurna_flags.none=none
espurna85.menu.espurna_flags.i2cSupport=I2C Support
espurna85.menu.espurna_flags.i2cSupport.build.espurna_flags=-DI2C_SUPPORT=1
espurna85.menu.espurna_flags.dallasSupport=Dallas Support
espurna85.menu.espurna_flags.dallasSupport.build.espurna_flags=-DDALLAS_SUPPORT=1
espurna85.menu.espurna_flags.dhtSupport=DHT Support
espurna85.menu.espurna_flags.dhtSupport.build.espurna_flags=-DDHT_SUPPORT=1
espurna85.menu.espurna_flags.hlw9012Support=HLW9012 Support
espurna85.menu.espurna_flags.hlw9012Support.build.espurna_flags=-DHLW8012_SUPPORT=1
espurna85.menu.my_project_flags.none=none
espurna85.menu.my_project_flags.nameresolv1=LLMNR Support
espurna85.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
espurna85.menu.my_project_flags.nameresolv2=NetBIOS Support
espurna85.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
espurna85.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
espurna85.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
espurna85.menu.ResetMethod.none=none
espurna85.menu.ResetMethod.none.upload.resetmethod=none
espurna85.menu.ResetMethod.dtrset=dtrset
espurna85.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
espurna85.menu.ResetMethod.ck=ck
espurna85.menu.ResetMethod.ck.upload.resetmethod=ck
espurna85.menu.ResetMethod.nodemcu=nodemcu
espurna85.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espurna85.build.flash_freq=40
espurna85.build.flash_mode=dout
espurna85.build.flash_flags=-DFLASHMODE_DOUT
espurna85.menu.eesz.1M=1M (no SPIFFS)
espurna85.menu.eesz.1M.build.flash_size=1M
espurna85.menu.eesz.1M.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
espurna85.menu.eesz.1M.build.spiffs_pagesize=256
espurna85.menu.eesz.1M.upload.maximum_size=1023984
espurna85.menu.eesz.1M.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M64=1M (64K SPIFFS)
espurna85.menu.eesz.1M64.build.flash_size=1M
espurna85.menu.eesz.1M64.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
espurna85.menu.eesz.1M64.build.spiffs_pagesize=256
espurna85.menu.eesz.1M64.upload.maximum_size=958448
espurna85.menu.eesz.1M64.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M64.build.spiffs_start=0xEB000
espurna85.menu.eesz.1M64.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M64.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M128=1M (128K SPIFFS)
espurna85.menu.eesz.1M128.build.flash_size=1M
espurna85.menu.eesz.1M128.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
espurna85.menu.eesz.1M128.build.spiffs_pagesize=256
espurna85.menu.eesz.1M128.upload.maximum_size=892912
espurna85.menu.eesz.1M128.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M128.build.spiffs_start=0xDB000
espurna85.menu.eesz.1M128.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M128.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M144=1M (144K SPIFFS)
espurna85.menu.eesz.1M144.build.flash_size=1M
espurna85.menu.eesz.1M144.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
espurna85.menu.eesz.1M144.build.spiffs_pagesize=256
espurna85.menu.eesz.1M144.upload.maximum_size=876528
espurna85.menu.eesz.1M144.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M144.build.spiffs_start=0xD7000
espurna85.menu.eesz.1M144.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M144.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M160=1M (160K SPIFFS)
espurna85.menu.eesz.1M160.build.flash_size=1M
espurna85.menu.eesz.1M160.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
espurna85.menu.eesz.1M160.build.spiffs_pagesize=256
espurna85.menu.eesz.1M160.upload.maximum_size=860144
espurna85.menu.eesz.1M160.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M160.build.spiffs_start=0xD3000
espurna85.menu.eesz.1M160.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M160.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M192=1M (192K SPIFFS)
espurna85.menu.eesz.1M192.build.flash_size=1M
espurna85.menu.eesz.1M192.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
espurna85.menu.eesz.1M192.build.spiffs_pagesize=256
espurna85.menu.eesz.1M192.upload.maximum_size=827376
espurna85.menu.eesz.1M192.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M192.build.spiffs_start=0xCB000
espurna85.menu.eesz.1M192.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M192.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M256=1M (256K SPIFFS)
espurna85.menu.eesz.1M256.build.flash_size=1M
espurna85.menu.eesz.1M256.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
espurna85.menu.eesz.1M256.build.spiffs_pagesize=256
espurna85.menu.eesz.1M256.upload.maximum_size=761840
espurna85.menu.eesz.1M256.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M256.build.spiffs_start=0xBB000
espurna85.menu.eesz.1M256.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M256.build.spiffs_blocksize=4096
espurna85.menu.eesz.1M512=1M (512K SPIFFS)
espurna85.menu.eesz.1M512.build.flash_size=1M
espurna85.menu.eesz.1M512.build.flash_size_bytes=0x100000
espurna85.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
espurna85.menu.eesz.1M512.build.spiffs_pagesize=256
espurna85.menu.eesz.1M512.upload.maximum_size=499696
espurna85.menu.eesz.1M512.build.rfcal_addr=0xFC000
espurna85.menu.eesz.1M512.build.spiffs_start=0x7B000
espurna85.menu.eesz.1M512.build.spiffs_end=0xFB000
espurna85.menu.eesz.1M512.build.spiffs_blocksize=4096
espurna85.menu.led.2=2
espurna85.menu.led.2.build.led=-DLED_BUILTIN=2
espurna85.menu.led.0=0
espurna85.menu.led.0.build.led=-DLED_BUILTIN=0
espurna85.menu.led.1=1
espurna85.menu.led.1.build.led=-DLED_BUILTIN=1
espurna85.menu.led.3=3
espurna85.menu.led.3.build.led=-DLED_BUILTIN=3
espurna85.menu.led.4=4
espurna85.menu.led.4.build.led=-DLED_BUILTIN=4
espurna85.menu.led.5=5
espurna85.menu.led.5.build.led=-DLED_BUILTIN=5
espurna85.menu.led.6=6
espurna85.menu.led.6.build.led=-DLED_BUILTIN=6
espurna85.menu.led.7=7
espurna85.menu.led.7.build.led=-DLED_BUILTIN=7
espurna85.menu.led.8=8
espurna85.menu.led.8.build.led=-DLED_BUILTIN=8
espurna85.menu.led.9=9
espurna85.menu.led.9.build.led=-DLED_BUILTIN=9
espurna85.menu.led.10=10
espurna85.menu.led.10.build.led=-DLED_BUILTIN=10
espurna85.menu.led.11=11
espurna85.menu.led.11.build.led=-DLED_BUILTIN=11
espurna85.menu.led.12=12
espurna85.menu.led.12.build.led=-DLED_BUILTIN=12
espurna85.menu.led.13.build.led=-DLED_BUILTIN=13
espurna85.menu.led.14=14
espurna85.menu.led.14.build.led=-DLED_BUILTIN=14
espurna85.menu.led.15=15
espurna85.menu.led.15.build.led=-DLED_BUILTIN=15
espurna85.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
espurna85.menu.sdk.nonosdk221.build.sdk=NONOSDK221
espurna85.menu.sdk.nonosdk222=nonos-sdk 2.2.2-190313 (testing)
espurna85.menu.sdk.nonosdk222.build.sdk=NONOSDK22x
espurna85.menu.sdk.nonosdk3v0=nonos-sdk pre-3 (known issues)
espurna85.menu.sdk.nonosdk3v0.build.sdk=NONOSDK3V0
espurna85.menu.ip.lm2f=v2 Lower Memory
espurna85.menu.ip.lm2f.build.lwip_include=lwip2/include
espurna85.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espurna85.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurna85.menu.ip.hb2f=v2 Higher Bandwidth
espurna85.menu.ip.hb2f.build.lwip_include=lwip2/include
espurna85.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espurna85.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espurna85.menu.ip.lm2n=v2 Lower Memory (no features)
espurna85.menu.ip.lm2n.build.lwip_include=lwip2/include
espurna85.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espurna85.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurna85.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espurna85.menu.ip.hb2n.build.lwip_include=lwip2/include
espurna85.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espurna85.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espurna85.menu.ip.lm6f=v2 IPv6 Lower Memory
espurna85.menu.ip.lm6f.build.lwip_include=lwip2/include
espurna85.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espurna85.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurna85.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espurna85.menu.ip.hb6f.build.lwip_include=lwip2/include
espurna85.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espurna85.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espurna85.menu.ip.hb1=v1.4 Higher Bandwidth
espurna85.menu.ip.hb1.build.lwip_lib=-llwip_gcc
espurna85.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
espurna85.menu.ip.src=v1.4 Compile from source
espurna85.menu.ip.src.build.lwip_lib=-llwip_src
espurna85.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
espurna85.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espurna85.menu.dbg.Disabled=Disabled
espurna85.menu.dbg.Disabled.build.debug_port=
espurna85.menu.dbg.Serial=Serial
espurna85.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espurna85.menu.dbg.Serial1=Serial1
espurna85.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espurna85.menu.lvl.None____=None
espurna85.menu.lvl.None____.build.debug_level=
espurna85.menu.lvl.SSL=SSL
espurna85.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espurna85.menu.lvl.TLS_MEM=TLS_MEM
espurna85.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espurna85.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espurna85.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espurna85.menu.lvl.HTTP_SERVER=HTTP_SERVER
espurna85.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espurna85.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espurna85.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espurna85.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espurna85.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espurna85.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espurna85.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurna85.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espurna85.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espurna85.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espurna85.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espurna85.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espurna85.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurna85.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espurna85.menu.lvl.CORE=CORE
espurna85.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espurna85.menu.lvl.WIFI=WIFI
espurna85.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espurna85.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espurna85.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espurna85.menu.lvl.UPDATER=UPDATER
espurna85.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espurna85.menu.lvl.OTA=OTA
espurna85.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espurna85.menu.lvl.OOM=OOM
espurna85.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espurna85.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna85.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna85.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna85.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espurna85.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espurna85.menu.wipe.none=Only Sketch
espurna85.menu.wipe.none.upload.erase_cmd=version
espurna85.menu.wipe.sdk=Sketch + WiFi Settings
espurna85.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espurna85.menu.wipe.all=All Flash Contents
espurna85.menu.wipe.all.upload.erase_cmd=erase_flash
espurna85.menu.baud.115200=115200
espurna85.menu.baud.115200.upload.speed=115200
espurna85.menu.baud.9600=9600
espurna85.menu.baud.9600.upload.speed=9600
espurna85.menu.baud.57600=57600
espurna85.menu.baud.57600.upload.speed=57600
espurna85.menu.baud.230400.linux=230400
espurna85.menu.baud.230400.macosx=230400
espurna85.menu.baud.230400.upload.speed=230400
espurna85.menu.baud.256000.windows=256000
espurna85.menu.baud.256000.upload.speed=256000
espurna85.menu.baud.460800.linux=460800
espurna85.menu.baud.460800.macosx=460800
espurna85.menu.baud.460800.upload.speed=460800
espurna85.menu.baud.512000.windows=512000
espurna85.menu.baud.512000.upload.speed=512000
espurna85.menu.baud.921600=921600
espurna85.menu.baud.921600.upload.speed=921600
